var stuid= -1;
var name2409=["孙蔓娜","曹逸飞","曹原","翟一帆","樊子全","付益丞","高咏梅","韩磊","胡静颖","胡淑涵","胡玉涵","贾喆","李恩熙","李佳瑶","李永健","李永琪","李元浩","梁鑫栋","廖钊平","刘幸涛","刘怡帆","刘小帆","刘泽源","刘子豪","鲁家瑞","罗雅文","罗雨诺","吕睿琪","马如龙","马文涛","马英淖","牛炳睿","冉铠源","师嘉豪","时弋斐","宋文轩","孙启翔","王冠润","王俊尧","王尚飞","王小雨","王玉莹","王玥","王子尧","吴蕊","仵昱同","徐志涛","杨文科","于子谦","张晨宇","张涵","张家诚","张可欣","张利胜","张世益","张文好","张邺旭","张莹","张悦涵","张云龙","周匡吉","朱凤祥","朱轩熠"];
function getstuid(){
 name=prompt("请输入您的姓名以获取数据\n（本地js处理，不会上传）\n帆姐：按称呼习惯改中间字为“小”");
 stuid=name2409.indexOf(name);
}
//数组来自于2409花名册-2023.2.xlsx